InsideWCF/Chapter04/HelloWCF/Messages/Say.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <To s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://localhost:4000/IHelloWCFContract</To>
    <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/IHelloWCFContract/Say</Action>
  </s:Header>
  <s:Body>
    <Say xmlns="http://tempuri.org/">
      <Input>Hi there AUTO WCF</Input>
    </Say>
  </s:Body>
</s:Envelope>